DataProcessors/ЗагрузкаТовараИзЕксель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаТовараИзЕксель</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДанныеЗагрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеЭтикетке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ЕдиницыИзмирения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмирения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Л</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Переоценка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Переоценка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Цены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмирения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмирения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеНаЭтикетке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальнаПродажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УКТЗЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШтрихКоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипШтрихКода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыШтрихКодов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаТовараИзЕксель/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Асинх Процедура ЗагрузитьИзБуфера(Команда)
    
    // Асинхронно получаем текст из буфера обмена (современный способ в 1С 8.3.18+)
    ТекстИзБуфера = Ждать СредстваБуфераОбмена.ПолучитьДанныеАсинх(СтандартныйФорматДанныхБуфераОбмена.Текст);
    
    Если ТекстИзБуфера = Неопределено Или ПустаяСтрока(ТекстИзБуфера) Тогда
        Сообщить("Буфер обмена пуст или недоступен!");
        Возврат;
    КонецЕсли;
    
    // Передаём текст на сервер для обработки
    ОбработкаДанныхБуфера(ТекстИзБуфера);
    
КонецПроцедуры

&НаСервере
Процедура ОбработкаДанныхБуфера(ТекстИзБуфера)
    
    // Очищаем табличную часть (если нужно — раскомментируйте)
    Объект.ДанныеЗагрузки.Очистить();
    
    // Разбиваем текст на строки
    МассивСтрок = СтрРазделить(ТекстИзБуфера, Символы.ПС, Ложь);
    
    Если МассивСтрок.Количество() = 0 Тогда
        Сообщить("Нет данных для загрузки в буфере обмена.");
        Возврат;
    КонецЕсли;
    
    // Пропускаем первую строку (заголовок), начинаем с индекса 1
    Для Инд = 1 По МассивСтрок.ВГраница() Цикл
        
        СтрокаТекста = СокрЛП(МассивСтрок[Инд]);
        
        Если ПустаяСтрока(СтрокаТекста) Тогда
            Продолжить; // Пропускаем пустые строки
        КонецЕсли;
        
        // Разбиваем строку на колонки по табуляции
        Колонки = СтрРазделить(СтрокаТекста, Символы.Таб, Ложь);
        
        // Минимально нужно хотя бы Код и Наименование — но допускаем любые варианты
        Если Колонки.Количество() = 0 Тогда
            Продолжить;
        КонецЕсли;
        
        НоваяСтрока = Объект.ДанныеЗагрузки.Добавить();
        
        // === Заполняем поля с проверкой на наличие колонки ===
        
        // 0 — Код
        Если Колонки.Количество() > 0 Тогда
            НоваяСтрока.Код = СокрЛП(Колонки[0]);
        КонецЕсли;
        
        // 1 — Наименование
        Если Колонки.Количество() > 1 Тогда
            НоваяСтрока.Наименование = СокрЛП(Колонки[1]);
        КонецЕсли;
        
        // 2 — Название на этикетке (или на ценнике)
        Если Колонки.Количество() > 2 Тогда
            НоваяСтрока.НазваниеЭтикетке = СокрЛП(Колонки[2]);
        КонецЕсли;
        
        // 3 — Единица измерения (строкой или код/наименование)
        Если Колонки.Количество() > 3 Тогда
            ЗначениеЕд = СокрЛП(Колонки[3]);
            Если Не ПустаяСтрока(ЗначениеЕд) Тогда
                НоваяСтрока.ЕдиницаИзмерения = ЗначениеЕд; // Если нужно — можно искать по справочнику
            КонецЕсли;
        КонецЕсли;
        
        // 4 — Штрихкод
        Если Колонки.Количество() > 4 Тогда
            НоваяСтрока.Штрихкод = СокрЛП(Колонки[4]);
        КонецЕсли;
        
        // 5 — ЭтоГруппа (Да/Нет/1/0/Истина/Ложь)
        Если Колонки.Количество() > 5 Тогда
            ЭтоГруппаСтр = ВРег(СокрЛП(Колонки[5]));
            НоваяСтрока.ЭтоГруппа = (ЭтоГруппаСтр = "ДА" 
                Или ЭтоГруппаСтр = "ИСТИНА" 
                Или ЭтоГруппаСтр = "1" 
                Или ЭтоГруппаСтр = "TRUE" 
                Или ЭтоГруппаСтр = "YES");
        КонецЕсли;
        
        // 6 — Родитель.Код
        Если Колонки.Количество() > 6 Тогда
            НоваяСтрока.РодительКод = СокрЛП(Колонки[6]);
        КонецЕсли;
        
        // 7 — Родитель.Наименование
        Если Колонки.Количество() > 7 Тогда
            НоваяСтрока.РодительНаименование = СокрЛП(Колонки[7]);
        КонецЕсли;
        
    КонецЦикла;
    
    Сообщить("Загрузка завершена. Добавлено строк: " + Объект.ДанныеЗагрузки.Количество());
    
КонецПроцедуры      

Процедура СоздатьГруппу(Код, Название)

	НомГруппа = Справочники.Номенклатура.СоздатьГруппу();
	НомГруппа.Наименование = СокрЛП(Название);
	НомГруппа.Код = Число(Код);
	НомГруппа.Записать();
	
КонецПроцедуры   

&НаСервере
Функция ОпределитьЕдИзмерения(ЕдИзм)

	Если ЕдИзм = "Шт." Тогда
		Возврат Перечисления.ЕдиницыИзмирения.Шт;
	ИначеЕсли ЕдИзм = "Кг." Тогда
    	Возврат Перечисления.ЕдиницыИзмирения.Кг;
    ИначеЕсли ЕдИзм = "Л." Тогда
    	Возврат Перечисления.ЕдиницыИзмирения.Л;
	КонецЕсли;
	
КонецФункции // ОпределитьЕдИзмерения()

Процедура ЗаполнитьНоменклатуру(Код, Наименование, НаЭтикетке, ЕдИзмерения, Штрихкод, Родитель=Неопределено)

	Ном = Справочники.Номенклатура.СоздатьЭлемент();   
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		Ном.Родитель = Родитель;
	КонецЕсли;
	
	Ном.Код = Число(Код);
	Ном.Наименование = СокрЛП(Наименование);
	Ном.НазваниеНаЭтикетке = СокрЛП(НаЭтикетке);
	Ном.ЕдиницаИзмирения = ОпределитьЕдИзмерения(ЕдИзмерения);
	
	НовыйШтрихкод = Ном.ШтрихКоды.Добавить();
	Попытка
		НовыйШтрихкод.ШтрихКод = Число(Штрихкод);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Неудалось преобразовать штрихкод " + Штрихкод + " к числу!";
		Сообщение.Сообщить();	  
	КонецПопытки;
	
	Ном.Записать();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьГруппыНаСервере()
	
	Для Каждого Данные Из Объект.ДанныеЗагрузки Цикл
		Если Данные.ЭтоГруппа = "Нет" Тогда
			Продолжить;
		КонецЕсли;
		
		СоздатьГруппу(Данные.Код, Данные.Наименование);	
	КонецЦикла;     
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппы(Команда)
	СоздатьГруппыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьНоменклатуруНаСервере()

	Для Каждого Данные Из Объект.ДанныеЗагрузки Цикл
		Если НЕ Данные.ЭтоГруппа = "Нет" Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьНоменклатуру(Данные.Код, Данные.Наименование, Данные.НазваниеЭтикетке, Данные.ЕдиницаИзмерения, Данные.Штрихкод);
		
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	СоздатьНоменклатуруНаСервере();
КонецПроцедуры

&НаСервере
Функция ПоискПоКоду(Код)
	Попытка 
		КодПоиска = Число(Код);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Неудалось преобразовать код "+ Код;
		Сообщение.Сообщить();  
	КонецПопытки;
	
	Ном = Справочники.Номенклатура.НайтиНоменклатуруПоКоду(КодПоиска);
	
	Если НЕ ЗначениеЗаполнено(Ном) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "По коду " + Код + " не удалось найти родителя!";
		Сообщение.Сообщить();                                                
	КонецЕсли;
	
	Возврат Ном;

КонецФункции // ПоискРодителя()


&НаКлиенте
Процедура ЗаполнитьРодителя(Команда)
	ЗаполнитьРодителяНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРодителяНаСервере()
	
	Для Каждого Данные Из Объект.ДанныеЗагрузки Цикл
		Если НЕ ЗначениеЗаполнено(Данные.РодительКод) Тогда
			Продолжить;
		КонецЕсли;
		
		Номенклатура = ПоискПоКоду(Данные.Код); 
		Родитель = ПоискПоКоду(Данные.РодительКод);
		
		Если Родитель = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		
		Если НЕ Родитель.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Ном = Номенклатура.ПолучитьОбъект(); 
		Ном.Родитель = Родитель;
		Ном.Записать();
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Асинх Процедура ЗагрузитьИзБуфераЦены(Команда)
    
    // Асинхронно получаем текст из буфера обмена (современный способ в 1С 8.3.18+)
    ТекстИзБуфера = Ждать СредстваБуфераОбмена.ПолучитьДанныеАсинх(СтандартныйФорматДанныхБуфераОбмена.Текст);
    
    Если ТекстИзБуфера = Неопределено Или ПустаяСтрока(ТекстИзБуфера) Тогда
        Сообщить("Буфер обмена пуст или недоступен!");
        Возврат;
    КонецЕсли;
    
    // Передаём текст на сервер для обработки
    ОбработкаДанныхБуфераЦены(ТекстИзБуфера);
    
КонецПроцедуры

&НаСервере
Процедура ОбработкаДанныхБуфераЦены(ТекстИзБуфера)
    
    // Очищаем табличную часть (если нужно — раскомментируйте)
    Объект.ДанныеЦен.Очистить();
    
    // Разбиваем текст на строки
    МассивСтрок = СтрРазделить(ТекстИзБуфера, Символы.ПС, Ложь);
    
    Если МассивСтрок.Количество() = 0 Тогда
        Сообщить("Нет данных для загрузки в буфере обмена.");
        Возврат;
    КонецЕсли;
    
    // Пропускаем первую строку (заголовок), начинаем с индекса 1
    Для Инд = 1 По МассивСтрок.ВГраница() Цикл
        
        СтрокаТекста = СокрЛП(МассивСтрок[Инд]);
        
        Если ПустаяСтрока(СтрокаТекста) Тогда
            Продолжить; // Пропускаем пустые строки
        КонецЕсли;
        
        // Разбиваем строку на колонки по табуляции
        Колонки = СтрРазделить(СтрокаТекста, Символы.Таб, Ложь);
        
        // Минимально нужно хотя бы Код и Наименование — но допускаем любые варианты
        Если Колонки.Количество() = 0 Тогда
            Продолжить;
        КонецЕсли;
        
        НоваяСтрока = Объект.ДанныеЦен.Добавить();
        
        // === Заполняем поля с проверкой на наличие колонки ===
        
        // 0 — Код
        Если Колонки.Количество() > 0 Тогда
            НоваяСтрока.Номенклатура = ПоискПоКоду(СокрЛП(Колонки[0]));
        КонецЕсли;
        
        // 1 — Наименование
        Если Колонки.Количество() > 1 Тогда
            НоваяСтрока.Цена = СокрЛП(Колонки[1]);
        КонецЕсли;
                
              
    КонецЦикла;
    
    Сообщить("Загрузка завершена. Добавлено строк: " + Объект.ДанныеЦен.Количество());
    
КонецПроцедуры      

&НаСервере
Процедура ЗаполнитьЦеныНаСервере()
	Переоценка = Документы.Переоценка.СоздатьДокумент();
	Переоценка.Дата = ТекущаяДата();
		
	Для Каждого Данные Из Объект.ДанныеЦен Цикл
		Если НЕ ЗначениеЗаполнено(Данные.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;  
		
		Если НЕ ЗначениеЗаполнено(Данные.Цена) Тогда
			Продолжить;
		КонецЕсли; 
		
		НоваяСтрока = Переоценка.СписокТоваров.Добавить();
		НоваяСтрока.Номенклатура = Данные.Номенклатура;
		НоваяСтрока.Цена = Данные.Цена;     
		
	КонецЦикла;         
	
	Переоценка.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦены(Команда)
	ЗаполнитьЦеныНаСервере();
КонецПроцедуры
